## Q21

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT *
FROM Customer, Orders
WHERE Customer.custid=Orders.custid
ORDER BY Customer.custid;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0    1         2              3   4  5   6      7           8
0  1  박지성   영국 맨체스타  000-5000-0001   1  1   1   6000  2014-07-01
1  1  박지성   영국 맨체스타  000-5000-0001   2  1   3  21000  2014-07-03
2  1  박지성   영국 맨체스타  000-5000-0001   6  1   2  12000  2014-07-07
3  2  김연아   대한민국 서울  000-6000-0001   3  2   5   8000  2014-07-03
4  2  김연아   대한민국 서울  000-6000-0001   9  2  10   7000  2014-07-09
5  3  장미란  대한민국 강원도  000-7000-0001   4  3   6   6000  2014-07-04
6  3  장미란  대한민국 강원도  000-7000-0001   8  3  10  12000  2014-07-08
7  3  장미란  대한민국 강원도  000-7000-0001  10  3   8  13000  2014-07-10
8  4  추신수  미국 클리블랜드  000-8000-0001   5  4   7  20000  2014-07-05
9  4  추신수  미국 클리블랜드  000-8000-0001   7  4   8  13000  2014-07-07

## Q22

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT name, saleprice 
FROM Customer, Orders
WHERE Customer.custid=Orders.custid;'''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0      1
0  박지성   6000
1  박지성  21000
2  박지성  12000
3  김연아   8000
4  김연아   7000
5  장미란   6000
6  장미란  12000
7  장미란  13000
8  추신수  20000
9  추신수  13000

## Q23

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT name, SUM(saleprice)
FROM Customer, Orders
WHERE Customer.custid=Orders.custid
GROUP BY Customer.name
ORDER BY Customer.name;'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0      1
0  김연아  15000
1  박지성  39000
2  장미란  31000
3  추신수  33000

## Q24

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT Customer.name, book.bookname 
FROM Customer, Orders, Book 
WHERE Customer.custid=Orders.custid AND Orders.bookid=Book.bookid;'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0                  1
0  박지성             축구의 역사
1  박지성             축구의 이해
2  김연아              피겨 교본
3  장미란           역도 단계별기술
4  추신수             야구의 추억
5  박지성            축구아는 여자
6  추신수            야구를 부탁해
7  장미란  Olympic Champions
8  김연아  Olympic Champions
9  장미란            야구를 부탁해

## Q25

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SELECT Customer.name, book.bookname
FROM Customer, Orders, Book 
WHERE Customer.custid=Orders.custid AND Orders.bookid=Book.bookid AND Book.price=20000;'''

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0       1
0  추신수  야구의 추억

## Q26(외부조인)

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql='''SELECT Customer.name, saleprice 
FROM Customer LEFT OUTER JOIN Orders 
ON Customer.custid=Orders.custid;'''

In [35]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1

      0        1
0   박지성   6000.0
1   박지성  21000.0
2   박지성  12000.0
3   김연아   8000.0
4   김연아   7000.0
5   장미란   6000.0
6   장미란  12000.0
7   장미란  13000.0
8   추신수  20000.0
9   추신수  13000.0
10  박세리      NaN

## Q27

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql='''SELECT bookname FROM Book 
WHERE price = (SELECT MAX(price) FROM Book);'''

In [41]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0
0  골프 바이블

## Q28

In [43]:
import pandas as pd
import pymysql

In [44]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [45]:
cur_1=conn1.cursor()

In [46]:
sql='''SELECT name FROM Customer 
WHERE custid IN (SELECT custid FROM Orders);'''

In [47]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [48]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0
0  박지성
1  김연아
2  장미란
3  추신수

## Q29

In [49]:
import pandas as pd
import pymysql

In [50]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [51]:
cur_1=conn1.cursor()

In [52]:
sql='''SELECT name FROM Customer 
WHERE custid IN(SELECT custid FROM Orders 
WHERE bookid IN(SELECT bookid FROM Book WHERE publisher='대한미디어'));'''

In [53]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [54]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0
0  박지성

## Q30

In [55]:
import pandas as pd
import pymysql

In [56]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [57]:
cur_1=conn1.cursor()

In [58]:
sql='''SELECT b1.bookname
FROM Book b1
WHERE b1.price > (SELECT avg(b2.price) FROM Book b2 
WHERE b2.publisher=b1.publisher);'''

In [59]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [60]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0
0  골프 바이블
1   피겨 교본
2  야구의 추억

## Q31

In [61]:
import pandas as pd
import pymysql

In [62]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [63]:
cur_1=conn1.cursor()

In [64]:
sql='''SELECT name 
FROM Customer 
WHERE address LIKE '대한민국%'
UNION  
SELECT name
FROM Customer 
WHERE custid IN (SELECT custid FROM Orders); '''

In [65]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [66]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0
0  김연아
1  장미란
2  박세리
3  박지성
4  추신수

## Q32

In [67]:
import pandas as pd
import pymysql

In [68]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [69]:
cur_1=conn1.cursor()

In [70]:
sql='''SELECT name, address 
FROM Customer cs 
WHERE EXISTS (SELECT * FROM Orders od WHERE cs.custid=od.custid);'''

In [71]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [72]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0         1
0  박지성   영국 맨체스타
1  김연아   대한민국 서울
2  장미란  대한민국 강원도
3  추신수  미국 클리블랜드